Revit 2027 API
Application.Username Property
 Gets the user name for the current Revit session.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Username { get; }
Public ReadOnly Property Username As String
	Get
public:
property String^ Username {
	String^ get ();
}
member Username : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace